
if (!window.pgf) {
    pgf = {};
}

if (!pgf.game) {
    pgf.game = {};
}

pgf.game.constants = {

    ACTOR_TYPE: {
"PERSON": 0, 
"PLACE": 1, 
"MONEY_SPENDING": 1000
},

    GENDER_TO_STR: {
"0": "мужчина", 
"1": "женщина", 
"2": "оно"
},

    PERSON_TYPE_TO_STR: {
"0": "кузнец", 
"1": "рыбак", 
"2": "портной", 
"3": "плотник", 
"4": "охотник", 
"5": "стражник", 
"6": "торговец", 
"7": "трактирщик", 
"8": "вор", 
"9": "фермер", 
"10": "шахтёр", 
"11": "священник", 
"12": "лекарь", 
"13": "алхимик", 
"14": "палач", 
"15": "волшебник", 
"16": "мэр", 
"17": "бюрократ", 
"18": "аристократ", 
"19": "бард", 
"20": "дрессировщик", 
"21": "скотовод"
},

    RACE_TO_STR: {
"0": "человек", 
"1": "эльф", 
"2": "орк", 
"3": "гоблин", 
"4": "дварф"
}
};