
if (!window.pgf) {
    pgf = {};
}

if (!pgf.game) {
    pgf.game = {};
}

pgf.game.constants = {

    ACTOR_TYPE: {
"PERSON": 0, 
"PLACE": 1, 
"MONEY_SPENDING": 1000
},

    GENDER_TO_STR: {
"0": "мужчина", 
"1": "женщина", 
"2": "оно"
},

    PERSON_TYPE_TO_STR: {
"0": "кузнец", 
"1": "рыбак", 
"2": "портной", 
"3": "плотник", 
"4": "охотник", 
"5": "стражник", 
"6": "торговец", 
"7": "трактирщик", 
"8": "вор", 
"9": "фермер", 
"10": "шахтёр", 
"11": "священник", 
"12": "лекарь", 
"13": "алхимик", 
"14": "палач", 
"15": "волшебник", 
"16": "мэр", 
"17": "бюрократ", 
"18": "аристократ", 
"19": "бард", 
"20": "дрессировщик", 
"21": "скотовод"
},

    RACE_TO_STR: {
"0": "человек", 
"1": "эльф", 
"2": "орк", 
"3": "гоблин", 
"4": "дварф"
},
    
    PVP_COMBAT_STYLES_ADVANTAGES: {
"0": {
"0": 1.0, 
"1": 1.33, 
"2": 0.67, 
"3": 1.17, 
"4": 0.83, 
"5": 1.0
}, 
"1": {
"0": 0.67, 
"1": 1.0, 
"2": 1.33, 
"3": 0.83, 
"4": 1.0, 
"5": 1.17
}, 
"2": {
"0": 1.33, 
"1": 0.67, 
"2": 1.0, 
"3": 1.0, 
"4": 1.17, 
"5": 0.83
}, 
"3": {
"0": 0.83, 
"1": 1.17, 
"2": 1.0, 
"3": 1.0, 
"4": 0.92, 
"5": 1.08
}, 
"4": {
"0": 1.17, 
"1": 1.0, 
"2": 0.83, 
"3": 1.08, 
"4": 1.0, 
"5": 0.92
}, 
"5": {
"0": 1.0, 
"1": 0.83, 
"2": 1.17, 
"3": 0.92, 
"4": 1.08, 
"5": 1.0
}
}
};