{
    "description": "",
    "prefix": "quest_interfereenemy",
    "variables": {"hero": "привидение", "person_end": "свинья", "place_start": "село", "place_end": "город"},
    "types": {

        "description": [["Сделать гадость противнику",
                         "Сделать гадость противнику"]],

        "action_move_to_quest": [["[[hero]] идёт на дело",
                                  "привидение идёт на дело"]],

        "diary_intro": [["Прошёл слух, что [[person_end|загл]] собирается провернуть новое дельце, что же, настало время свести старые счёты.",
                         "Прошёл слух, что Свинья собирается провернуть новое дельце, что же, настало время свести старые счёты."]]
    }
}
