# coding: utf-8

from the_tale.linguistics.lexicon.dictionary import noun

MODIFIER_TRADE_CENTER = noun([u'Торговый центр', u'Торгового центра', u'Торговому центру', u'Торговый центр', u'Торговым центром', u'Торговом центре',
                              u'Торговые центры', u'Торговых центров', u'Торговым центрам', u'Торговые центры', u'Торговыми центрами', u'Торговых центров'], u'но,мр')
MODIFIER_CRAFT_CENTER = noun([u'Город мастеров', u'Города мастеров', u'Городу мастеров', u'Город мастеров', u'Городом мастеров', u'Городе мастеров',
                              u'Города мастеров', u'Городов мастеров', u'Городам мастеров', u'Города мастеров', u'Городами мастеров', u'Городах мастеров'], u'но,мр')
MODIFIER_FORT = noun([u'Форт', u'Форта', u'Форту', u'Форт', u'Фортом', u'Форте',
                      u'Форты', u'Фортов', u'Фортам', u'Форты', u'Фортами', u'Фортах'], u'но,мр')
MODIFIER_POLITICAL_CENTER = noun([u'Политический центр', u'Политического центра', u'Политическому центру', u'Политический центр', u'Политическим центров', u'Политическом центре',
                                  u'Политические центры', u'Политических центров', u'Политическим центрам', u'Политические центры', u'Политическими центрами', u'Политических центрах'], u'но,мр')
MODIFIER_POLIC = noun([u'Полис', u'Полиса', u'Полису', u'Полис', u'Полисом', u'Полисе',
                       u'Полисы', u'Полисов', u'Полисам', u'Полисы', u'Полисами', u'Полисах'], u'но,мр')
MODIFIER_RESORT = noun([u'Курорт', u'Курорта', u'Курорту', u'Курорт', u'Курортом', u'Курорте',
                        u'Курорты', u'Курортов', u'Курортам', u'Курорты', u'Курортами', u'Курортах'], u'но,мр')
MODIFIER_TRANSPORT_NODE = noun([u'Транспортный узел', u'Транспортного узла', u'Транспортному узлу', u'Транспортный узел', u'Транспортным узлом', u'Транспортном узле',
                                u'Транспортные узлы', u'Транспортных узлов', u'Транспортным узлам', u'Транспортные узлы', u'Транспортными узлами', u'Транспортных узлах'], u'но,мр')
MODIFIER_OUTLAWS = noun([u'Вольница', u'Вольницы', u'Вольнице', u'Вольницу', u'Вольницой', u'Вольнице',
                         u'Вольницы', u'Вольниц', u'Вольницам', u'Вольницы', u'Вольницами', u'Вольницах'], u'но,мр')
MODIFIER_HOLY_CITY = noun([u'Святой город', u'Святого города', u'Святому городу', u'Святой город', u'Святым городом', u'Святом городе',
                           u'Святые города', u'Святых городов', u'Святым городам', u'Святые города', u'Святыми городами', u'Святых городах'], u'но,мр')
