# coding: utf-8

from the_tale.linguistics.lexicon.dictionary import noun


RACE_HUMANS = noun([u'человек', u'человека', u'человеку', u'человека', u'человеком', u'человеке',
                    u'люди', u'людей', u'людям', u'людей', u'людьми', u'людях'], u'од,мр',
                   countable=[u'человек', u'человек', u'человекам', u'человек', u'человеками', u'человеках'])
RACE_ELFS = noun([u'эльф', u'эльфа', u'эльфу', u'эльфа', u'эльфом', u'эльфе',
                  u'эльфы', u'эльфов', u'эльфам', u'эльфов', u'эльфами', u'эльфах'], u'од,мр')
RACE_ORCS = noun([u'орк', u'орка', u'орку', u'орка', u'орком', u'орке',
                  u'орки', u'орков', u'оркам', u'орков', u'орками', u'орках'], u'од,мр')
RACE_GOBLINS = noun([u'гоблин', u'гоблина', u'гоблину', u'гоблина', u'гоблином', u'гоблине',
                     u'гоблины', u'гоблинов', u'гоблинам', u'гоблинов', u'гоблинами', u'гоблинах'], u'од,мр')
RACE_DWARFS = noun([u'дварф', u'дварфа', u'дварфу', u'дварфа', u'дварфом', u'дварфе',
                    u'дварфы', u'дварфов', u'дварфам', u'дварфов', u'дварфами', u'дварфах'], u'од,мр')
