
if (!window.pgf) {
    pgf = {};
}

if (!pgf.game) {
    pgf.game = {};
}

pgf.game.constants = {

    ACTOR_TYPE: {"PERSON": 0, "PLACE": 1, "MONEY_SPENDING": 2},

    GENDER_TO_TEXT: {"0": "мужчина", "1": "женщина"},
    GENDER_TO_STR: {"0": "MALE", "1": "FEMALE"},

    PERSON_TYPE_TO_TEXT: {"0": "кузнец", "1": "рыбак", "2": "портной", "3": "плотник", "4": "охотник", "5": "стражник", "6": "торговец", "7": "трактирщик", "8": "вор", "9": "фермер", "10": "шахтёр", "11": "священник", "12": "лекарь", "13": "алхимик", "14": "палач", "15": "волшебник", "16": "ростовщик", "17": "писарь", "18": "магомеханик", "19": "бард", "20": "дрессировщик", "21": "скотовод"},

    RACE_TO_TEXT: {"0": {"male": "мужчина", "female": "женщина"}, "1": {"male": "эльф", "female": "эльфийка"}, "2": {"male": "орк", "female": "оркесса"}, "3": {"male": "гоблин", "female": "гоблинша"}, "4": {"male": "дварф", "female": "дварфийка"}},

    PERSONALITY_PRACTICAL_TO_TEXT: {1: {'male': 'многомудрый', 'female': 'многомудрая'}, 2: {'male': 'влиятельный', 'female': 'влиятельная'}, 3: {'male': 'щедрый', 'female': 'щедрая'}, 4: {'male': 'харизматичный', 'female': 'харизматичная'}, 5: {'male': 'мстительный', 'female': 'мстительная'}, 6: {'male': 'деятельный', 'female': 'деятельная'}, 7: {'male': 'надёжный', 'female': 'надёжная'}, 8: {'male': 'аккуратный', 'female': 'аккуратная'}, 9: {'male': 'набожный', 'female': 'набожная'}, 10: {'male': 'трудолюбивый', 'female': 'трудолюбивая'}, 11: {'male': 'предприимчивый', 'female': 'предприимчивая'}, 12: {'male': 'романтичный', 'female': 'романтичная'}, 13: {'male': 'ответственный', 'female': 'ответственная'}, 14: {'male': 'коварный', 'female': 'коварная'}},
    PERSONALITY_COSMETIC_TO_TEXT: {0: {'male': 'правдолюб', 'female': 'правдолюбка'}, 1: {'male': 'плут', 'female': 'плутовка'}, 2: {'male': 'добряк', 'female': 'добрячка'}, 3: {'male': 'забияка', 'female': 'забияка'}, 4: {'male': 'лидер', 'female': 'лидер'}, 5: {'male': 'непоседа', 'female': 'непоседа'}, 6: {'male': 'поручитель', 'female': 'поручительница'}, 7: {'male': 'нигилист', 'female': 'нигилистка'}, 8: {'male': 'затворник', 'female': 'затворница'}, 9: {'male': 'организатор', 'female': 'организатор'}},

    GAME_STATE: {"STOPPED": 0, "WORKING": 1},
};

pgf.game.constants.ARTIFACT_TYPE = {
        "USELESS": {
        "id": 0,
        "name": "хлам"
    },    "MAIN_HAND": {
        "id": 1,
        "name": "основная рука"
    },    "OFF_HAND": {
        "id": 2,
        "name": "вторая рука"
    },    "PLATE": {
        "id": 3,
        "name": "доспех"
    },    "AMULET": {
        "id": 4,
        "name": "амулет"
    },    "HELMET": {
        "id": 5,
        "name": "шлем"
    },    "CLOAK": {
        "id": 6,
        "name": "плащ"
    },    "SHOULDERS": {
        "id": 7,
        "name": "наплечники"
    },    "GLOVES": {
        "id": 8,
        "name": "перчатки"
    },    "PANTS": {
        "id": 9,
        "name": "штаны"
    },    "BOOTS": {
        "id": 10,
        "name": "обувь"
    },    "RING": {
        "id": 11,
        "name": "кольцо"
    }};

pgf.game.constants.ARTIFACT_RARITY = {
        "NORMAL": {
        "id": 0,
        "name": "обычный артефакт"
    },    "RARE": {
        "id": 1,
        "name": "редкий артефакт"
    },    "EPIC": {
        "id": 2,
        "name": "эпический артефакт"
    }};

pgf.game.constants.CARD_RARITY = {
        "0": {
        "name": "COMMON",
        "text": "обычная карта"
    },    "1": {
        "name": "UNCOMMON",
        "text": "необычная карта"
    },    "2": {
        "name": "RARE",
        "text": "редкая карта"
    },    "3": {
        "name": "EPIC",
        "text": "эпическая карта"
    },    "4": {
        "name": "LEGENDARY",
        "text": "легендарная карта"
    }};

pgf.game.constants.CARD_TYPE = {
        "10": {
        "text": "горсть монет",
        "rarity": 0,
        "description": "Герой получает 1000 монет.",
        "combiners": [
                        "3 x «горсть монет» => «увесистый кошель»"        ]
    },    "11": {
        "text": "увесистый кошель",
        "rarity": 1,
        "description": "Герой получает 3500 монет.",
        "combiners": [
                        "3 x «увесистый кошель» => «сундучок на счастье»"        ]
    },    "12": {
        "text": "сундучок на счастье",
        "rarity": 2,
        "description": "Герой получает 12000 монет.",
        "combiners": [
                        "3 x «сундучок на счастье» => «клад»"        ]
    },    "39": {
        "text": "альтернатива",
        "rarity": 1,
        "description": "Изменяет список предлагаемых герою способностей (при выборе новой способности).",
        "combiners": [
                        "3 x «альтернатива» => 1 x «новый путь»"        ]
    },    "45": {
        "text": "фея-мастерица",
        "rarity": 1,
        "description": "Чинит случайный артефакт из экипировки героя.",
        "combiners": [
                        "3 x «фея-мастерица» => 1 x «благословение Великого Творца»"        ]
    },    "46": {
        "text": "благословение Великого Творца",
        "rarity": 2,
        "description": "Чинит все артефакты из экипировки героя.",
        "combiners": [
                    ]
    },    "47": {
        "text": "другие заботы",
        "rarity": 0,
        "description": "Отменяет текущее задание героя. Если герой выполняет цепочку заданий, отменяется вся цепочка.",
        "combiners": [
                        "2 x «другие заботы» => 1 x «снова в путь»"        ]
    },    "48": {
        "text": "внезапная находка",
        "rarity": 0,
        "description": "Герой получает случайный бесполезный предмет.",
        "combiners": [
                        "3 x «внезапная находка» => «полезный подарок»"        ]
    },    "49": {
        "text": "полезный подарок",
        "rarity": 1,
        "description": "Герой получает случайный артефакт лучше экипированного, близкий архетипу героя.",
        "combiners": [
                        "3 x «полезный подарок» => «редкое приобретение»"        ]
    },    "50": {
        "text": "редкое приобретение",
        "rarity": 2,
        "description": "Герой получает случайный редкий артефакт лучше экипированного, близкий архетипу героя.",
        "combiners": [
                        "3 x «редкое приобретение» => «дар Хранителя»"        ]
    },    "51": {
        "text": "дар Хранителя",
        "rarity": 3,
        "description": "Герой получает случайный эпический артефакт лучше экипированного, близкий архетипу героя.",
        "combiners": [
                    ]
    },    "52": {
        "text": "длань Смерти",
        "rarity": 0,
        "description": "Мгновенно убивает монстра, с которым сражается герой.",
        "combiners": [
                        "2 x «длань Смерти» => 1 x «передышка»"        ]
    },    "53": {
        "text": "неразменная монета",
        "rarity": 0,
        "description": "Временно увеличивает производство в указанном городе на  1. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                        "3 x «неразменная монета» => «волшебный горшочек»"        ]
    },    "54": {
        "text": "волшебный горшочек",
        "rarity": 1,
        "description": "Временно увеличивает производство в указанном городе на  3. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                        "3 x «волшебный горшочек» => «скатерть самобранка»"        ]
    },    "55": {
        "text": "скатерть самобранка",
        "rarity": 2,
        "description": "Временно увеличивает производство в указанном городе на  12. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                        "3 x «скатерть самобранка» => «несметные богатства»"        ]
    },    "56": {
        "text": "несметные богатства",
        "rarity": 3,
        "description": "Временно увеличивает производство в указанном городе на  42. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                        "3 x «несметные богатства» => «рог изобилия»"        ]
    },    "0": {
        "text": "рог изобилия",
        "rarity": 4,
        "description": "Временно увеличивает производство в указанном городе на  150. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                    ]
    },    "74": {
        "text": "удачная мысль",
        "rarity": 0,
        "description": "Увеличивает опыт, который герой получит за выполнение текущего задания, на 50 единиц.",
        "combiners": [
                        "3 x «удачная мысль» => «чистый разум»"        ]
    },    "75": {
        "text": "чистый разум",
        "rarity": 1,
        "description": "Увеличивает опыт, который герой получит за выполнение текущего задания, на 175 единиц.",
        "combiners": [
                        "3 x «чистый разум» => «неожиданные осложнения»"        ]
    },    "76": {
        "text": "неожиданные осложнения",
        "rarity": 2,
        "description": "Увеличивает опыт, который герой получит за выполнение текущего задания, на 600 единиц.",
        "combiners": [
                        "3 x «неожиданные осложнения» => «слово Гзанзара»"        ]
    },    "77": {
        "text": "слово Гзанзара",
        "rarity": 3,
        "description": "Увеличивает опыт, который герой получит за выполнение текущего задания, на 2100 единиц.",
        "combiners": [
                        "3 x «слово Гзанзара» => «благословение Гзанзара»"        ]
    },    "78": {
        "text": "новые обстоятельства",
        "rarity": 0,
        "description": "Увеличивает влияние текущего задания, на 48 базовых единиц. Итоговый бонус зависит от влиятельности героя. Можно использовать только одну карту на задание.",
        "combiners": [
                        "3 x «новые обстоятельства» => «специальная операция»"        ]
    },    "79": {
        "text": "специальная операция",
        "rarity": 1,
        "description": "Увеличивает влияние текущего задания, на 172 базовых единиц. Итоговый бонус зависит от влиятельности героя. Можно использовать только одну карту на задание.",
        "combiners": [
                        "3 x «специальная операция» => «слово Дабнглана»"        ]
    },    "80": {
        "text": "слово Дабнглана",
        "rarity": 2,
        "description": "Увеличивает влияние текущего задания, на 600 базовых единиц. Итоговый бонус зависит от влиятельности героя. Можно использовать только одну карту на задание.",
        "combiners": [
                        "3 x «слово Дабнглана» => «благословение Дабнглана»"        ]
    },    "81": {
        "text": "благословение Дабнглана",
        "rarity": 3,
        "description": "Увеличивает влияние текущего задания, на 2058 базовых единиц. Итоговый бонус зависит от влиятельности героя. Можно использовать только одну карту на задание.",
        "combiners": [
                        "3 x «благословение Дабнглана» => «туз в рукаве»"        ]
    },    "82": {
        "text": "телепорт",
        "rarity": 0,
        "description": "Телепортирует героя до ближайшего города либо до ближайшей ключевой точки задания.",
        "combiners": [
                        "3 x «телепорт» => 1 x «ТАРДИС»"        ]
    },    "83": {
        "text": "ТАРДИС",
        "rarity": 1,
        "description": "Телепортирует героя в конечную точку назначения либо до ближайшей ключевой точки задания.",
        "combiners": [
                    ]
    },    "88": {
        "text": "волшебное точило",
        "rarity": 1,
        "description": "Улучшает случайный артефакт из экипировки героя.",
        "combiners": [
                        "3 x «волшебное точило» => 1 x «суть вещей»"        ]
    },    "89": {
        "text": "суть вещей",
        "rarity": 2,
        "description": "Улучшает все артефакты из экипировки героя.",
        "combiners": [
                    ]
    },    "90": {
        "text": "обычный спутник",
        "rarity": 0,
        "description": "Герой получает спутника, указанного в названии карты. Если у героя уже есть спутник, он покинет героя.",
        "combiners": [
                        "2 x «обычный спутник» => «обычный спутник» с другим эффектом",            "3 x «обычный спутник» => «необычный спутник»"        ]
    },    "91": {
        "text": "необычный спутник",
        "rarity": 1,
        "description": "Герой получает спутника, указанного в названии карты. Если у героя уже есть спутник, он покинет героя.",
        "combiners": [
                        "2 x «необычный спутник» => «необычный спутник» с другим эффектом",            "3 x «необычный спутник» => «редкий спутник»"        ]
    },    "92": {
        "text": "редкий спутник",
        "rarity": 2,
        "description": "Герой получает спутника, указанного в названии карты. Если у героя уже есть спутник, он покинет героя.",
        "combiners": [
                        "2 x «редкий спутник» => «редкий спутник» с другим эффектом",            "3 x «редкий спутник» => «эпический спутник»"        ]
    },    "93": {
        "text": "эпический спутник",
        "rarity": 3,
        "description": "Герой получает спутника, указанного в названии карты. Если у героя уже есть спутник, он покинет героя.",
        "combiners": [
                        "2 x «эпический спутник» => «эпический спутник» с другим эффектом",            "3 x «эпический спутник» => «легендарный спутник»"        ]
    },    "94": {
        "text": "легендарный спутник",
        "rarity": 4,
        "description": "Герой получает спутника, указанного в названии карты. Если у героя уже есть спутник, он покинет героя.",
        "combiners": [
                        "2 x «легендарный спутник» => «легендарный спутник» с другим эффектом"        ]
    },    "97": {
        "text": "благословение Гзанзара",
        "rarity": 4,
        "description": "Увеличивает опыт, который герой получит за выполнение текущего задания, на 7500 единиц.",
        "combiners": [
                    ]
    },    "98": {
        "text": "новый путь",
        "rarity": 2,
        "description": "Сбрасывает все способности героя.",
        "combiners": [
                    ]
    },    "99": {
        "text": "четыре стороны",
        "rarity": 0,
        "description": "Спутник героя навсегда покидает его.",
        "combiners": [
                        "3 x «четыре стороны» => 1 x «отгул»"        ]
    },    "100": {
        "text": "передышка",
        "rarity": 0,
        "description": "Восстанавливает спутнику 15 здоровья.",
        "combiners": [
                        "3 x «передышка» => «подорожник»"        ]
    },    "101": {
        "text": "подорожник",
        "rarity": 1,
        "description": "Восстанавливает спутнику 53 здоровья.",
        "combiners": [
                        "3 x «подорожник» => «священный мёд»"        ]
    },    "102": {
        "text": "священный мёд",
        "rarity": 2,
        "description": "Восстанавливает спутнику 180 здоровья.",
        "combiners": [
                        "3 x «священный мёд» => «молодильное яблоко»"        ]
    },    "103": {
        "text": "молодильное яблоко",
        "rarity": 3,
        "description": "Восстанавливает спутнику 630 здоровья.",
        "combiners": [
                    ]
    },    "106": {
        "text": "скрытый потенциал",
        "rarity": 3,
        "description": "Заменяет случайный экипированный не эпический артефакт, на более редкий того же вида. Параметры нового артефакта могут быть ниже параметров старого.",
        "combiners": [
                    ]
    },    "107": {
        "text": "туз в рукаве",
        "rarity": 4,
        "description": "Увеличивает влияние текущего задания, на 7200 базовых единиц. Итоговый бонус зависит от влиятельности героя. Можно использовать только одну карту на задание.",
        "combiners": [
                    ]
    },    "116": {
        "text": "новая цель",
        "rarity": 0,
        "description": "Меняет текущую цель трат героя на указанную в названии",
        "combiners": [
                        "2 x «новая цель» => «новая цель» с другим эффектом"        ]
    },    "117": {
        "text": "свежий взгляд",
        "rarity": 0,
        "description": "Позволяет изменить указанное в названии предпочтение героя.",
        "combiners": [
                        "2 x «свежий взгляд» => «свежий взгляд» с другим эффектом"        ]
    },    "118": {
        "text": "сомнения",
        "rarity": 0,
        "description": "Изменяет черту героя на 10 единиц в указанную в названии сторону.",
        "combiners": [
                        "2 x «сомнения» => «сомнения» с другим эффектом",            "3 x одинаковых «сомнения» => «прозрение» с тем же эффектом",            "3 x «сомнения» => «прозрение»"        ]
    },    "119": {
        "text": "прозрение",
        "rarity": 1,
        "description": "Изменяет черту героя на 35 единиц в указанную в названии сторону.",
        "combiners": [
                        "2 x «прозрение» => «прозрение» с другим эффектом",            "3 x одинаковых «прозрение» => «откровение» с тем же эффектом",            "3 x «прозрение» => «откровение»"        ]
    },    "120": {
        "text": "откровение",
        "rarity": 2,
        "description": "Изменяет черту героя на 120 единиц в указанную в названии сторону.",
        "combiners": [
                        "2 x «откровение» => «откровение» с другим эффектом",            "3 x одинаковых «откровение» => «когнитивный диссонанс» с тем же эффектом",            "3 x «откровение» => «когнитивный диссонанс»"        ]
    },    "121": {
        "text": "когнитивный диссонанс",
        "rarity": 3,
        "description": "Изменяет черту героя на 420 единиц в указанную в названии сторону.",
        "combiners": [
                        "2 x «когнитивный диссонанс» => «когнитивный диссонанс» с другим эффектом",            "3 x одинаковых «когнитивный диссонанс» => «экзистенциальный кризис» с тем же эффектом",            "3 x «когнитивный диссонанс» => «экзистенциальный кризис»"        ]
    },    "122": {
        "text": "экзистенциальный кризис",
        "rarity": 4,
        "description": "Изменяет черту героя на 1500 единиц в указанную в названии сторону.",
        "combiners": [
                        "2 x «экзистенциальный кризис» => «экзистенциальный кризис» с другим эффектом"        ]
    },    "133": {
        "text": "братство",
        "rarity": 2,
        "description": "Создаёт новую гильдию и делает игрока её лидером. Обратите внимание, выполнять задания эмиссаров гильдии могут только Хранители, обладающие соответствующим правом.",
        "combiners": [
                        "1 x «братство» => 9 x «гильдейские дела»"        ]
    },    "136": {
        "text": "клад",
        "rarity": 3,
        "description": "Герой получает 42000 монет.",
        "combiners": [
                        "3 x «клад» => «фарт»"        ]
    },    "137": {
        "text": "фарт",
        "rarity": 4,
        "description": "Герой получает 150000 монет.",
        "combiners": [
                    ]
    },    "138": {
        "text": "отгул",
        "rarity": 1,
        "description": "Вы получаете карту призыва текущего спутника вашего героя. Спутник покидает героя. Слаженность спутника в карте не сохраняется. Возможность продать новую карту определяется возможностью продать текущую.",
        "combiners": [
                    ]
    },    "139": {
        "text": "наставление",
        "rarity": 0,
        "description": "Увеличивает опыт спутника на 10 единиц.",
        "combiners": [
                        "2 x «наставление» => 1 x «передышка»",            "3 x «наставление» => «совместная тренировка»"        ]
    },    "140": {
        "text": "совместная тренировка",
        "rarity": 1,
        "description": "Увеличивает опыт спутника на 35 единиц.",
        "combiners": [
                        "3 x «совместная тренировка» => «товарищество»"        ]
    },    "141": {
        "text": "товарищество",
        "rarity": 2,
        "description": "Увеличивает опыт спутника на 120 единиц.",
        "combiners": [
                        "3 x «товарищество» => «единство»"        ]
    },    "142": {
        "text": "единство",
        "rarity": 3,
        "description": "Увеличивает опыт спутника на 420 единиц.",
        "combiners": [
                        "3 x «единство» => «синхронизация»"        ]
    },    "143": {
        "text": "синхронизация",
        "rarity": 4,
        "description": "Увеличивает опыт спутника на 1500 единиц.",
        "combiners": [
                    ]
    },    "144": {
        "text": "удачный поворот",
        "rarity": 1,
        "description": "Даёт карты обычной редкости (4 шт.). Если эту карту можно продавать, то: полученные карты можно будет продавать, могут быть получены карты, доступные только подписчикам.",
        "combiners": [
                        "3 x «удачный поворот» => «колесо фортуны»"        ]
    },    "145": {
        "text": "колесо фортуны",
        "rarity": 2,
        "description": "Даёт карты обычной редкости (12 шт.). Если эту карту можно продавать, то: полученные карты можно будет продавать, могут быть получены карты, доступные только подписчикам.",
        "combiners": [
                        "3 x «колесо фортуны» => «белая полоса»"        ]
    },    "146": {
        "text": "белая полоса",
        "rarity": 3,
        "description": "Даёт карты обычной редкости (42 шт.). Если эту карту можно продавать, то: полученные карты можно будет продавать, могут быть получены карты, доступные только подписчикам.",
        "combiners": [
                        "3 x «белая полоса» => «прядь Кайроса»"        ]
    },    "147": {
        "text": "прядь Кайроса",
        "rarity": 4,
        "description": "Даёт карты обычной редкости (150 шт.). Если эту карту можно продавать, то: полученные карты можно будет продавать, могут быть получены карты, доступные только подписчикам.",
        "combiners": [
                    ]
    },    "148": {
        "text": "тишина",
        "rarity": 1,
        "description": "Увеличивает стабильность в указанном городе на 1.0%. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                        "3 x «тишина» => «спокойствие»"        ]
    },    "149": {
        "text": "спокойствие",
        "rarity": 2,
        "description": "Увеличивает стабильность в указанном городе на 3.5%. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                        "3 x «спокойствие» => «проповедь»"        ]
    },    "150": {
        "text": "проповедь",
        "rarity": 3,
        "description": "Увеличивает стабильность в указанном городе на 12.0%. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                        "3 x «проповедь» => «Adeptus Arbites»"        ]
    },    "151": {
        "text": "Adeptus Arbites",
        "rarity": 4,
        "description": "Увеличивает стабильность в указанном городе на 42.0%. Бонус будет постепенно уменьшаться и исчезнет через 15 дней.",
        "combiners": [
                    ]
    },    "152": {
        "text": "взмах бабочки",
        "rarity": 0,
        "description": "Позволяет изменить часть истории героя, указанную в названии карты.",
        "combiners": [
                        "2 x «взмах бабочки» => «взмах бабочки» с другим эффектом"        ]
    },    "153": {
        "text": "дебют",
        "rarity": 2,
        "description": "Ваша гильдия получит 9 очков действия.",
        "combiners": [
                        "3 x «дебют» => «миттельшпиль»"        ]
    },    "154": {
        "text": "миттельшпиль",
        "rarity": 3,
        "description": "Ваша гильдия получит 29 очков действия.",
        "combiners": [
                        "3 x «миттельшпиль» => «эндшпиль»"        ]
    },    "155": {
        "text": "эндшпиль",
        "rarity": 4,
        "description": "Ваша гильдия получит 100 очков действия.",
        "combiners": [
                    ]
    },    "157": {
        "text": "гильдейские дела",
        "rarity": 0,
        "description": "Моментально выдаёт герою задание на помощь или вред эмиссару. Эффект указан в названии карты. Если герой выполняет задания, все они отменяются. Если герой сражается с монстром, тот будет убит. Карту нельзя использовать, когда герой сражается на Арене. Величина влияния за задание рассчитывается по общим правилам. Если эффект задания противоречит предпочтениям героя, предпочтения будут проигнорированы. Начать задание может член гильдии с соответствующими правами. Если карту нельзя продать на аукционе (карта получена неподписчиком), её можно будет использовать только на эмиссарах своей гильдии и при её использовании будет отнято одно свободное задание гильдии. Выполнять задания, связанные с эмиссарами чужих гильдий, могут только члены гильдии с достаточно развитым эмиссаром.",
        "combiners": [
                        "2 x одинаковых «гильдейские дела» => «гильдейские дела» с другим эффектом",            "2 x «гильдейские дела» => 1 x «снова в путь»",            "9 x «гильдейские дела» => 1 x «братство»"        ]
    },    "156": {
        "text": "снова в путь",
        "rarity": 0,
        "description": "Заставляет героя взять задание, если тот бездельничает.",
        "combiners": [
                        "2 x «снова в путь» => 1 x «гильдейские дела»"        ]
    },    "158": {
        "text": "общественные дела",
        "rarity": 2,
        "description": "Моментально выдаёт герою задание на помощь или вред городу. Эффект указан в названии карты. Влияние засчитывается так, как если бы герой имел город в предпочтении. Если герой выполняет задания, все они отменяются. Если герой сражается с монстром, тот будет убит. Карту нельзя использовать, когда герой сражается на Арене. Величина влияния за задание рассчитывается по общим правилам. Если эффект задания противоречит предпочтениям героя, предпочтения будут проигнорированы.",
        "combiners": [
                        "2 x одинаковых «общественные дела» => «общественные дела» с другим эффектом",            "3 x «общественные дела» => 1 x «личные дела»"        ]
    },    "159": {
        "text": "личные дела",
        "rarity": 3,
        "description": "Моментально выдаёт герою задание на помощь или вред Мастеру. Эффект указан в названии карты. Влияние засчитывается так, как если бы герой имел Мастера в предпочтении. Если герой выполняет задания, все они отменяются. Если герой сражается с монстром, тот будет убит. Карту нельзя использовать, когда герой сражается на Арене. Величина влияния за задание рассчитывается по общим правилам. Если эффект задания противоречит предпочтениям героя, предпочтения будут проигнорированы.",
        "combiners": [
                        "2 x одинаковых «личные дела» => «личные дела» с другим эффектом",            "1 x «личные дела» => 3 x «общественные дела»"        ]
    },    "160": {
        "text": "регенерация",
        "rarity": 0,
        "description": "Полностью восстанавливает здоровье героя. Воскрешает героя, если тот мёртв.",
        "combiners": [
                    ]
    }};

pgf.game.constants.NO_EFFECT_ID = 666;

pgf.game.constants.EFFECTS = {
        "0": {
        "name": "мощь",
        "description": "Немного увеличивает физический урон"
    },    "1": {
        "name": "колдовство",
        "description": "Немного увеличивает магический урон"
    },    "2": {
        "name": "хорошая реакция",
        "description": "Немного увеличивает инициативу героя в бою"
    },    "3": {
        "name": "здоровье",
        "description": "Немного увеличивает максимальное здоровье героя"
    },    "4": {
        "name": "повышение интуиции",
        "description": "Немного увеличивает получаемый героем опыт"
    },    "5": {
        "name": "хитрость",
        "description": "Немного увеличивает влияние героя (бонус к влиянию: 20%)"
    },    "7": {
        "name": "скороход",
        "description": "Немного увеличивает скорость движения героя"
    },    "8": {
        "name": "карманы",
        "description": "Немного увеличивает вместимость рюкзака героя"
    },    "1000": {
        "name": "небывалая мощь",
        "description": "Сильно увеличивает физический урон"
    },    "1001": {
        "name": "могучее колдовство",
        "description": "Сильно увеличивает магический урон"
    },    "1002": {
        "name": "превосходная реакция",
        "description": "Сильно увеличивает инициативу героя в бою"
    },    "1003": {
        "name": "невероятное здоровье",
        "description": "Сильно увеличивает максимальное здоровье героя"
    },    "1004": {
        "name": "сверхинтуиция",
        "description": "Сильно увеличивает получаемый героем опыт"
    },    "1005": {
        "name": "особая хитрость",
        "description": "Сильно увеличивает влияние героя  (бонус к влиянию: 60%)"
    },    "1007": {
        "name": "неутомимый скороход",
        "description": "Сильно увеличивает скорость движения героя"
    },    "1008": {
        "name": "большие карманы",
        "description": "Сильно увеличивает вместимость рюкзака героя"
    },    "1009": {
        "name": "выносливость",
        "description": "Герой быстрее восстанавливает здоровье во время отдыха"
    },    "1010": {
        "name": "живучесть",
        "description": "Герой быстрее восстаёт из мёртвых"
    },    "1011": {
        "name": "деятельность",
        "description": "Герой меньше бездельничает"
    },    "1012": {
        "name": "убеждение",
        "description": "Уменьшение всех трат"
    },    "1013": {
        "name": "очарование",
        "description": "Увеличение цены продажи предметов"
    },    "1015": {
        "name": "душевное равновесие",
        "description": "иногда увеличивает в два раза эффект ритуала в честь Хранителя"
    },    "6": {
        "name": "концентрация",
        "description": "в редких случаях увеличивает в два раза эффект ритуала в честь Хранителя"
    },    "1016": {
        "name": "особая аура",
        "description": "Физическая и магическая сила всех артефактов, получаемых героем, увеличивается на 1"
    },    "1018": {
        "name": "последний шанс",
        "description": "Герою становится доступна способность «Последний шанс» максимального уровня"
    },    "1017": {
        "name": "регенерация",
        "description": "Герою становится доступна способность «Регенерация» максимального уровня"
    },    "1019": {
        "name": "лёд",
        "description": "Герою становится доступна способность «Контроль» максимального уровня"
    },    "1020": {
        "name": "пламя",
        "description": "Герою становится доступна способность «Пиромания» максимального уровня"
    },    "1021": {
        "name": "яд",
        "description": "Герою становится доступна способность «Ядовитость» максимального уровня"
    },    "1022": {
        "name": "вампиризм",
        "description": "Герою становится доступна способность «Вампиризм» максимального уровня"
    },    "1033": {
        "name": "ускорение",
        "description": "Герою становится доступна способность «Ускорение» максимального уровня"
    },    "1025": {
        "name": "точные атаки",
        "description": "Герою становится доступна способность «Критический удар» максимального уровня"
    },    "1026": {
        "name": "астральная преграда",
        "description": "Герою становится доступна способность «Горгулья» максимального уровня"
    },    "1034": {
        "name": "безрассудность",
        "description": "Герою становится доступна способность «Безрассудная атака» максимального уровня"
    },    "1023": {
        "name": "живость ума",
        "description": "Слаженность спутника растёт на 25% быстрее"
    },    "1024": {
        "name": "ужасный вид",
        "description": "Герой выглядит настолько ужасно, что некоторые противники в ужасе убегают, не вступая в бой"
    },    "1027": {
        "name": "затуманенный разум",
        "description": "Разум героя затуманивается и тот начинает вести себя независимо от черт"
    },    "1028": {
        "name": "удача странника",
        "description": "Увеличивается шанс получения редких артефактов"
    },    "1029": {
        "name": "удача героя",
        "description": "Увеличивается шанс получения эпических артефактов"
    },    "1030": {
        "name": "крепость духа",
        "description": "Черты героя уменьшаются медленнее"
    },    "1031": {
        "name": "идейность",
        "description": "Черты героя растут быстрее"
    },    "1032": {
        "name": "нерушимость",
        "description": "Экипировка героя медленнее ломается"
    },    "666": {
        "name": "нет эффекта",
        "description": "нет эффекта"
    },    "100001": {
        "name": "детский подарок",
        "description": "Это потерянный подарок ребёнка. Помогите герою, когда артефакт лежит в рюкзаке, и подарок вернётся к ребёнку."
    }};

pgf.game.constants.linguistics_formatters = {

    
    "420005": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "420007": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "620074": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "620077": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "620082": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "620085": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "620086": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span>",
    
    "620089": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span>",
    
    "340002": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!duelist_1!</span> <span class='log-short log-short-effectiveness-up' rel='tooltip' title='полученная эффективность'>+!effectiveness!👁</span>",
    
    "4": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "11": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!actor!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "12": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!actor!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "480008": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "180001": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "540006": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "540007": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!sell_price!☉</span>",
    
    "540008": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "540009": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "540010": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "600003": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "220001": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "360023": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "360026": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "580004": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "580005": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "580006": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion_owner!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "580007": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "580008": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "520005": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "440005": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "560021": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "560026": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "560028": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "560030": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "460008": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "500005": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "380016": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span>",
    
    "380018": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "380020": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "240008": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "240010": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!mob!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "240012": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "240014": "",
    
    "240015": "",
    
    "240016": "",
    
    "240020": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "80002": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!sell_price!☉</span>",
    
    "80003": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!sell_price!☉</span>",
    
    "80004": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "80007": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "80008": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "80009": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "80010": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "80027": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "80029": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "80030": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "80032": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span>",
    
    "80035": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-down' rel='tooltip' title='потерянные монеты'>-!coins!☉</span> <span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "80037": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "400020": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "400022": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "400025": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40001": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40002": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40005": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40006": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40009": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40010": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40013": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40014": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40017": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40018": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40021": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40022": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40025": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40026": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "40029": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "40030": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!hero!</span> <span class='log-short log-short-gold-up' rel='tooltip' title='полученные монеты'>+!coins!☉</span>",
    
    "160005": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160006": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160007": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160008": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160024": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160025": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160009": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160026": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160027": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160010": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160011": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160012": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160013": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160028": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160029": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160014": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160030": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "160031": "<span class='log-short log-short-exp-up' rel='tooltip' title='полученный опыт'>+!experience!★</span>",
    
    "280000": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!defender!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "280003": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!defender!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "280008": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!actor!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "280009": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!defender!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "280013": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!defender!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "280015": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!attacker!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span> <span class='log-short log-short-name' rel='tooltip' title='актёр'>!defender!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>",
    
    "280017": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!companion!</span> <span class='log-short log-short-hp-up' rel='tooltip' title='восстановленное здоровье'>+!health!♥</span>",
    
    "280018": "<span class='log-short log-short-name' rel='tooltip' title='актёр'>!attacker!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!attacker_damage!♥</span> <span class='log-short log-short-name' rel='tooltip' title='актёр'>!defender!</span> <span class='log-short log-short-hp-down' rel='tooltip' title='полученный урон'>-!damage!♥</span>"
    
};


pgf.game.constants.sprites = {

    
    "0": {
        "x": "0",
        "y": "256"
    },

    
    "1": {
        "x": "32",
        "y": "256"
    },

    
    "2": {
        "x": "64",
        "y": "256"
    },

    
    "3": {
        "x": "96",
        "y": "256"
    },

    
    "4": {
        "x": "128",
        "y": "256"
    },

    
    "5": {
        "x": "160",
        "y": "256"
    },

    
    "6": {
        "x": "192",
        "y": "256"
    },

    
    "7": {
        "x": "224",
        "y": "256"
    },

    
    "8": {
        "x": "256",
        "y": "256"
    },

    
    "9": {
        "x": "288",
        "y": "256"
    },

    
    "10": {
        "x": "0",
        "y": "256"
    },

    
    "11": {
        "x": "64",
        "y": "256"
    },

    
    "12": {
        "x": "128",
        "y": "256"
    },

    
    "13": {
        "x": "192",
        "y": "256"
    },

    
    "14": {
        "x": "256",
        "y": "256"
    },

    
    "15": {
        "x": "128",
        "y": "64"
    },

    
    "16": {
        "x": "96",
        "y": "64"
    },

    
    "17": {
        "x": "32",
        "y": "64"
    },

    
    "18": {
        "x": "0",
        "y": "64"
    },

    
    "19": {
        "x": "32",
        "y": "0"
    },

    
    "20": {
        "x": "96",
        "y": "0"
    },

    
    "21": {
        "x": "128",
        "y": "0"
    },

    
    "22": {
        "x": "160",
        "y": "0"
    },

    
    "23": {
        "x": "0",
        "y": "0"
    },

    
    "24": {
        "x": "64",
        "y": "0"
    },

    
    "25": {
        "x": "0",
        "y": "32"
    },

    
    "26": {
        "x": "32",
        "y": "32"
    },

    
    "27": {
        "x": "64",
        "y": "32"
    },

    
    "28": {
        "x": "96",
        "y": "32"
    },

    
    "29": {
        "x": "160",
        "y": "64"
    },

    
    "30": {
        "x": "224",
        "y": "0"
    },

    
    "31": {
        "x": "352",
        "y": "0"
    },

    
    "32": {
        "x": "320",
        "y": "0"
    },

    
    "33": {
        "x": "288",
        "y": "0"
    },

    
    "34": {
        "x": "192",
        "y": "0"
    },

    
    "35": {
        "x": "256",
        "y": "0"
    },

    
    "36": {
        "x": "192",
        "y": "32"
    },

    
    "37": {
        "x": "224",
        "y": "32"
    },

    
    "38": {
        "x": "256",
        "y": "32"
    },

    
    "39": {
        "x": "288",
        "y": "32"
    },

    
    "40": {
        "x": "192",
        "y": "64"
    },

    
    "41": {
        "x": "224",
        "y": "64"
    },

    
    "42": {
        "x": "64",
        "y": "64"
    },

    
    "43": {
        "x": "352",
        "y": "32"
    },

    
    "44": {
        "x": "0",
        "y": "192"
    },

    
    "45": {
        "x": "32",
        "y": "192"
    },

    
    "46": {
        "x": "64",
        "y": "192"
    },

    
    "47": {
        "x": "96",
        "y": "192"
    },

    
    "48": {
        "x": "128",
        "y": "192"
    },

    
    "49": {
        "x": "160",
        "y": "192"
    },

    
    "50": {
        "x": "192",
        "y": "192"
    },

    
    "51": {
        "x": "224",
        "y": "192"
    },

    
    "52": {
        "x": "256",
        "y": "192"
    },

    
    "53": {
        "x": "288",
        "y": "192"
    },

    
    "54": {
        "x": "320",
        "y": "192"
    },

    
    "55": {
        "x": "352",
        "y": "192"
    },

    
    "56": {
        "x": "0",
        "y": "224"
    },

    
    "57": {
        "x": "32",
        "y": "224"
    },

    
    "58": {
        "x": "64",
        "y": "224"
    },

    
    "59": {
        "x": "96",
        "y": "224"
    },

    
    "60": {
        "x": "128",
        "y": "224"
    },

    
    "61": {
        "x": "160",
        "y": "224"
    },

    
    "62": {
        "x": "192",
        "y": "224"
    },

    
    "63": {
        "x": "224",
        "y": "224"
    },

    
    "64": {
        "x": "96",
        "y": "96"
    },

    
    "65": {
        "x": "32",
        "y": "96"
    },

    
    "66": {
        "x": "160",
        "y": "96"
    },

    
    "67": {
        "x": "64",
        "y": "96"
    },

    
    "68": {
        "x": "128",
        "y": "96"
    },

    
    "69": {
        "x": "0",
        "y": "96"
    },

    
    "70": {
        "x": "0",
        "y": "288"
    },

    
    "71": {
        "x": "32",
        "y": "288"
    },

    
    "72": {
        "x": "0",
        "y": "128"
    },

    
    "73": {
        "x": "32",
        "y": "128"
    },

    
    "74": {
        "x": "64",
        "y": "128"
    },

    
    "75": {
        "x": "96",
        "y": "128"
    },

    
    "76": {
        "x": "128",
        "y": "128"
    },

    
    "77": {
        "x": "160",
        "y": "128"
    },

    
    "78": {
        "x": "192",
        "y": "128"
    },

    
    "79": {
        "x": "224",
        "y": "128"
    },

    
    "80": {
        "x": "256",
        "y": "128"
    },

    
    "81": {
        "x": "288",
        "y": "128"
    },

    
    "82": {
        "x": "320",
        "y": "128"
    },

    
    "83": {
        "x": "352",
        "y": "128"
    },

    
    "84": {
        "x": "0",
        "y": "160"
    },

    
    "85": {
        "x": "32",
        "y": "160"
    },

    
    "86": {
        "x": "64",
        "y": "160"
    },

    
    "87": {
        "x": "96",
        "y": "160"
    },

    
    "88": {
        "x": "128",
        "y": "160"
    },

    
    "89": {
        "x": "160",
        "y": "160"
    },

    
    "90": {
        "x": "192",
        "y": "160"
    },

    
    "91": {
        "x": "224",
        "y": "160"
    },

    
    "92": {
        "x": "256",
        "y": "160"
    },

    
    "93": {
        "x": "288",
        "y": "160"
    },

    
    "CELL_HIGHLIGHTING": "71",
    "SELECT_LAND": "70"

}

pgf.game.constants.tilesets = {

    main: {
        TILE_SIZE: 32,
        W: 32,
        H: 32,
        SRC: "/game/images/map.png",
        sprites: jQuery.extend(true, {}, pgf.game.constants.sprites)
    },

    alternative: {
        TILE_SIZE: 32,
        W: 32,
        H: 32,
        SRC: "/game/images/map_alternative.png",
        sprites: jQuery.extend(true, {}, pgf.game.constants.sprites)
    },

    alternative_2: {
        TILE_SIZE: 32,
        W: 32,
        H: 32,
        SRC: "/game/images/map_alternative_2.png",
        sprites: jQuery.extend(true, {}, pgf.game.constants.sprites)
    },

    alternative_3: {
        TILE_SIZE: 32,
        W: 32,
        H: 32,
        SRC: "/game/images/map_alternative_3.png",
        sprites: jQuery.extend(true, {}, pgf.game.constants.sprites)
    },

    winter: {
        TILE_SIZE: 32,
        W: 32,
        H: 32,
        SRC: "/game/images/map_winter.png",
        sprites: jQuery.extend(true, {}, pgf.game.constants.sprites)
    },

    large_pixel: {
        TILE_SIZE: 32,
        W: 32,
        H: 32,
        SRC: "/game/images/map_large_pixel.png",
        sprites: jQuery.extend(true, {}, pgf.game.constants.sprites)
    },

    cosmos: {
        TILE_SIZE: 32,
        W: 32,
        H: 32,
        SRC: "/game/images/map_cosmos.png",
        sprites: jQuery.extend(true, {}, pgf.game.constants.sprites)
    },
};


for (var tilesetName in pgf.game.constants.tilesets) {
    var tileset = pgf.game.constants.tilesets[tilesetName];

    for (var spriteName in tileset.sprites) {
        var sprite = tileset.sprites[spriteName];

        if (typeof(sprite)=='string') continue;

        if (sprite.w == undefined) sprite.w = tileset.W;
        if (sprite.h == undefined) sprite.h = tileset.H;
        if (sprite.src == undefined) sprite.src = tileset.SRC;
    }
}