
from the_tale.linguistics.lexicon.dictionary import noun


RACE_HUMANS = noun(['человек', 'человека', 'человеку', 'человека', 'человеком', 'человеке',
                    'люди', 'людей', 'людям', 'людей', 'людьми', 'людях',
                    'человек', 'человек', 'человекам', 'человек', 'человеками', 'человеках'], 'од,мр')
RACE_ELFS = noun(['эльф', 'эльфа', 'эльфу', 'эльфа', 'эльфом', 'эльфе',
                  'эльфы', 'эльфов', 'эльфам', 'эльфов', 'эльфами', 'эльфах',
                  'эльфы', 'эльфов', 'эльфам', 'эльфов', 'эльфами', 'эльфах'], 'од,мр')
RACE_ORCS = noun(['орк', 'орка', 'орку', 'орка', 'орком', 'орке',
                  'орки', 'орков', 'оркам', 'орков', 'орками', 'орках',
                  'орки', 'орков', 'оркам', 'орков', 'орками', 'орках'], 'од,мр')
RACE_GOBLINS = noun(['гоблин', 'гоблина', 'гоблину', 'гоблина', 'гоблином', 'гоблине',
                     'гоблины', 'гоблинов', 'гоблинам', 'гоблинов', 'гоблинами', 'гоблинах',
                     'гоблины', 'гоблинов', 'гоблинам', 'гоблинов', 'гоблинами', 'гоблинах'], 'од,мр')
RACE_DWARFS = noun(['дварф', 'дварфа', 'дварфу', 'дварфа', 'дварфом', 'дварфе',
                    'дварфы', 'дварфов', 'дварфам', 'дварфов', 'дварфами', 'дварфах',
                    'дварфы', 'дварфов', 'дварфам', 'дварфов', 'дварфами', 'дварфах'], 'од,мр')
